// russian translation
translation("ru", {
    "language.change.success"           :   "Вы успешно изменили язык интерфейса на русский!"

    "vehicle.owner.warning"             :   "Вы не можете передвигаться в чужом автомобиле."
    "vehicle.owner.true"                :   "Вы владелец данного авто."
    "vehicle.owner.false"               :   "Вы не владелец данного авто."

    "hospital.money.deducted"           :   "Вас выписали из госпиталя. Лечение обошлось вам в $%.2f."
    "hospital.money.donthave"           :   "У вас недостаточно денег для оплаты полного лечения."

    "client.interface.job"              :   "Работа: %s"
    "client.interface.level"            :   "Уровень: %d"

    "msg.weapons"   : "Это RolePlay сервер. Только банды и мафии могут владеть оружием."

    "general.admins.serial.get"                 : "Cерийный номер игрока %s: %s"

    "general.message.empty"                     : "[INFO] Вы не можете отправить пустое сообщение."
    "general.playeroffline"                     : "[INFO] Данного игрока нет на сервере!"
    "general.noonearound"                       : "Рядом с вами никого нет."
    "general.job.anotherone"                    : "Вы работаете %s, а не %s!"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "tips.money.earn"   :   "[TIPS] Вы можете зарабатывать деньги, устроившись на работу. Подробнее: /help job"
    "tips.money.bank"   :   "[TIPS] Вы можете получать доход от депозита в банке (желтая иконка на радаре)."
    "tips.car"          :   "[TIPS] Вы можете купить собственный автомобиль в Diamond Motors (серая иконка шестеренки на радаре)."
    "tips.car.repair"   :   "[TIPS] Вы можете починить свой автомобиль в автомастерских."
    "tips.eat"          :   "[TIPS] Вы можете восстанавливать уровень здоровья, обедая в ресторанах."
    "tips.police"       :   "[TIPS] Если вы стали свидетелем преступления - бегите к телефонной будке и вызывайте полицию. Команда: /police"
    "tips.hobos"        :   "[TIPS] Вы можете найти деньги в мусорных контейнерах. Используйте команду: /dig"
    "tips.engine.howto" :   "[TIPS] Не забывайте экономить топливо, используйте кнопку Q для выключения двигателя."
    "tips.taxi"         :   "[TIPS] Если вам нужно куда-то добраться, вы можете вызвать такси из телефонной будки: /taxi"
    "tips.metro"        :   "[TIPS] Метро - это удобный и дешевый способ передвижения. Найдите ближайшую станцию с помощью /subway"
    "tips.house"        :   "[TIPS] Вы можете купить дом. Найдите риелтора, чтобы заключить сделку."
    "tips.report"       :   "[TIPS] Увидели читера? Или игрока нарушающего правила? Сообщите администрации: /report ID ТЕКСТ"
    "tips.idea"         :   "[TIPS] У вас есть идея или предложение, сообщите об этом нам, используя команду: /idea ТЕКСТ"
    "tips.discord"      :   "[TIPS] Вы можете следить за новостями разработки на официальном сервере Discord: bit.ly/tsoeb"
    "tips.vk"           :   "[TIPS] Вступайте в нашу группу ВКонтакте: vk.com/tsoeb"
    "tips.layout"       :   "[TIPS] Вы можете сменить раскладку клавиатуры (бинды останутся на прежних местах как для qwerty). См. /layout"
    "tips.business"     :   "[TIPS] Вы можете приобрести бизнес. Находясь у бизнеса, напишите команду /business buy"
    "tips.sellcar"      :   "[TIPS] Вы можете продать свой автомобиль другому игроку. Находясь в авто, используйте команду /sell"
    "tips.bugreport"    :   "[TIPS] Обнаружили ошибку или баг? Напишите нам: /bug ТЕКСТ"
    "tips.openmap"      :   "[TIPS] Вы можете открыть карту города, нажав на клавишу M (английскую)."
    "tips.switchchats"  :   "[TIPS] Для переключения между слотами чата используйте клавиши F1-F4."
    "tips.chatvisible"  :   "[TIPS] Если вы хотите скрыть чат - нажмите клавишу F5. Повторное нажатие отобразит чат."
    "tips.turnlights"   :   "[TIPS] Z - левый поворотник; X - аварийка; C - правый поворотник."
    "tips.dice"         :   "[TIPS] Чтобы бросить кубик, используйте: /dice"
    "tips.hat"          :   "[TIPS] /hat X - вытащить из шляпы один шар из X шаров."
    "tips.enabled"      :   "[TIPS] Подсказки были включены."
    "tips.disabled"     :   "[TIPS] Подсказки были выключены."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */




/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "auth.wrongname"        : "К сожалению, имя аккаунта не может быть меньше 4 символов. Использовать можно английские буквы, цифры, пробел и нижнее подчеркивание."
    "auth.changename"       : "Пожалуйста, смените имя аккаунта в настройках и переподключитесь!"
    "auth.welcome"          : "* Добро пожаловать, %s!"
    "auth.registered"       : "* Ваш аккаунт зарегистрирован."
    "auth.notregistered"    : "* Ваш аккаунт НЕ зарегистрирован."
    "auth.command.register" : "* Зарегистрируйтесь, используя /register ваш_пароль"
    "auth.command.regformat": "* Пример: Joe Barbaro"
    "auth.command.login"    : "* Войдите в аккаунт, используя: /login ваш_пароль"
    "auth.error.logined"    : "[AUTH] Вы уже вошли в аккаунт!"
    "auth.error.login"      : "[AUTH] Вы уже вошли в аккаунт!"
    "auth.error.register"   : "[AUTH] Аккаунт с такими именем уже зарегистрирован."
    "auth.error.notfound"   : "[AUTH] Логин или пароль были введены неправильно."
    "auth.success.register" : "[AUTH] Вы успешно зарегистрировались!"
    "auth.success.login"    : "[AUTH] Вы успешно вошли в аккаунт!"
    "auth.success.autologin": "[AUTH] Вы были успешно авторизованы автоматически!"
    "auth.error.cmderror"   : "[AUTH] Для выполнения команды Вам необходимо войти в аккаунт!"
    "auth.notification"     : "[AUTH] Вам нужно войти в свой аккаунт используя /login ваш_пароль, или создать новый через /register ваш_пароль"
    "auth.error.tomany"     : "[AUTH] Вы достигли лимита по количеству аккаунтов."
    "auth.error.email"      : "Такой email адрес уже используется!"
    "auth.client.notloaded" : "Кажется ваши клиент-скрипты не прогрузились. Попробуйте переподключиться!"

    "auth.GUI.TitleRegister"            : "Регистрация"
    "auth.GUI.TitleLabelRegister"       : "Регистрация нового аккаунта. Заполните поля ниже:"
    "auth.GUI.PasswordInput"            : "Придумайте пароль:"
    "auth.GUI.RepeatPasswordInput"      : "Повторите пароль:"
    "auth.GUI.Email"                    : "Email:"
    "auth.GUI.ButtonRegister"           : "Зарегистрироваться"

    "auth.GUI.TitleLogin"       : "Авторизация"
    "auth.GUI.TitleLabelLogin"  : "Аккаунт уже зарегистрирован. Введите ваш пароль:"
    "auth.GUI.TitleInputLogin"  : "Пароль"
    "auth.GUI.ButtonLogin"      : "Авторизоваться"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "business.money.income"     : "Вы получили %.2f в качестве дохода от вашего бизнеса «%s»!"
    "business.error.cantbuy"    : "Сейчас у Вас нет возможности купить бизнес!"
    "business.error.faraway"    : "Вы далеко от бизнеса!"
    "business.error.owned"      : "Вы не можете приобрести бизнес, который уже находится в собственности!"
    "business.purchase.success" : "Вы успешно приобрели «%s»!"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "general.message.empty"         : "[INFO] Вы не можете отправить пустую строку"
    "general.noonearound"           : "Рядом с вами никого нет."

    "chat.togoocEnabled"            : "Вы включили отображение ООС чата!"
    "chat.togoocDisabled"           : "Вы отключили отображение ООС чата!"

    "chat.togpmEnabled"            : "Вы включили личные сообщения!"
    "chat.togpmDisabled"           : "Вы отключили личные сообщения!"

    "chat.playerTogPm"              :"Игрок отключил возможность отправлять ему личные сообщения!"

    "chat.player.says"              : "%s: %s"
    "chat.player.shout"             : "%s крикнул: %s"
    "chat.player.whisper"           : "%s шепчет: %s"
    "chat.player.message.private"   : "[PM] %s пишет %s: %s"
    "chat.player.try.end.success"   : "[TRY] %s: %s (успех)."
    "chat.player.try.end.fail"      : "[TRY] %s: %s (провал)."
    "chat.player.message.noplayer"  : "[PM] Такого игрока нет на сервере.",

    "chat.bug.success"              : "[BUG] Ваше сообщение об ошибке успешно отправлено. Спасибо! ;)"
    "chat.idea.success"             : "[IDEA] Ваша идея успешно отправлена!"
    "chat.report.success"           : "[REPORT] Ваш репорт успешно отправлен!"
    "chat.report.noplayer"          : "[REPORT] Вы не можете создать репорт на игрока, который находится в оффлайн!"
    "chat.report.error"             : "[REPORT] Вам необходимо отправить репорт в виде: /report ID TEXT"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "job.leave"                         :   "Вы уволились с работы."
    "job.alreadyhavejob"                :   "У вас уже есть работа: %s."
    "job.checkmyjob"                    :   "Ваша работа: %s."
    "job.unemployed"                    :   "У вас нет работы."
    "job.false"                         :   "безработный"
    "job.closed"                        :   "Вы пришли в неподходящее время. Приходите с %s:00 до %s:00."
    "job.nojob"                         :   "Сейчас нет работы. Приходи в другое время."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */


/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "job.truckdriver"                   : "шофёр"

    "job.truckdriver.scens1.load"       : "Садись в открытый грузовик %s и отправляйся в Северный Милвилл для загрузки строительных материалов."
    "job.truckdriver.scens1.unload"     : "Грузовик загружен. Отправляйся в Мидтаун для разгрузки строительных материалов."

    "job.truckdriver.scens2.load"       : "Садись в открытый грузовик %s и отправляйся в Хантерс-Пойнт для погрузки обломков сгоревшего дома."
    "job.truckdriver.scens2.unload"     : "Грузовик загружен. Отправляйся в Северный Милвилл для разгрузки обломков сгоревшего дома."

    "job.truckdriver.scens3.load"       : "Садись в открытый грузовик %s и отправляйся в Мидтаун для погрузки обломков разрушенного здания."
    "job.truckdriver.scens3.unload"     : "Грузовик загружен. Отправляйся в Северный Милвилл для разгрузки обломков разрушенного здания."

    "job.truckdriver.scens4.load"       : "Садись в крытый грузовик %s и отправляйся в Южный Милвилл для погрузки товара."
    "job.truckdriver.scens4.unload"     : "Грузовик загружен. Отправляйся в Сэнд-Айленд для разгрузки."

    "job.truckdriver.scens5.load"       : "Садись в открытый грузовик %s и отправляйся в Мидтаун для погрузки обломков разрушенного здания."
    "job.truckdriver.scens5.unload"     : "Грузовик загружен. Отправляйся в Северный Милвилл для разгрузки обломков разрушенного здания."

    "job.truckdriver.scens6.load"       : "В одном из баров намечается фуршет серьёзных людей. Нужно доставить грузовик с алкоголем. Садись в крытый грузовик %s и отправляйся к ликёро-водочному заводу для погрузки ящиков. Всё уже оплачено."
    "job.truckdriver.scens6.unload"     : "Грузовик загружен. Отправляйся к бару «Зелёный холм» в Кингстоне для разгрузки ящиков с алкоголем."

    "job.truckdriver.scens7.load"       : "Во время бурной пирушки в баре завязался знатный мордобой: все бутылки с алкоголем пошли в расход. Нужно восполнить ассортимент. Садись в крытый грузовик %s и отправляйся к ликёро-водочному заводу для погрузки ящиков."
    "job.truckdriver.scens7.unload"     : "Грузовик загружен. Отправляйся к бару «Дрэгстрип» в Северном Милвилле для разгрузки ящиков с алкоголем."

    "job.truckdriver.badworker"         : "Robert Casey: Плохой из тебя работник. Для такого как ты у меня нет работы."
    "job.truckdriver.badworker.onleave" : "Robert Casey: Херовый ты работник. Вали нахрен."
    "job.truckdriver.goodluck"          : "Robert Casey: Удачи тебе, пацан! Приходи, если нужна работа."
    "job.truckdriver.needcomplete"      : "Robert Casey: Сначала заверши доставку."
    "job.truckdriver.nicejob"           : "Robert Casey: Отличная работа, %s! Держи $%.2f."
    "job.truckdriver.now"               : "Robert Casey: Добро пожаловать в ряды шофёров!"

    "job.truckdriver.needtruck"         : "Вам нужен грузовик %s."
    "job.truckdriver.needlevel"         : "[TRUCK] Шофёром можно устроиться начиная с уровня %d."
    "job.truckdriver.wantwork"          : "[TRUCK] Ты работаешь шофёром. Если хочешь поработать - отправляйся к транспортной базе у моста в Хайбрук."
    "job.truckdriver.already"           : "[TRUCK] Ты уже работаешь шофёром."
    "job.truckdriver.notpassenger"      : "[TRUCK] Доставка может осуществляться только водителем, но не пассажиром."
    "job.truckdriver.loading"           : "[TRUCK] Грузовик загружается. Подожди..."
    "job.truckdriver.unloading"         : "[TRUCK] Грузовик разгружается. Подожди..."
    "job.truckdriver.alreadyloaded"     : "[TRUCK] Грузовик уже загружен."
    "job.truckdriver.empty"             : "[TRUCK] Грузовик пуст."
    "job.truckdriver.takemoney"         : "[TRUCK] Возвращайся на базу к мосту в Хайбрук, припаркуй грузовик и получи заработанные деньги."

    "job.truckdriver.help.title"        : "Список команд, доступных шофёру:"
    "job.truckdriver.help.job"              :   "кнопка E"
    "job.truckdriver.help.jobtext"          :   "Устроиться на работу шофёром (подойти к Robert Casey)"
    "job.truckdriver.help.jobleave"         :   "кнопка Q"
    "job.truckdriver.help.jobleavetext"     :   "Уволиться с работы (подойти к Robert Casey)"
    "job.truckdriver.help.loadunload"       :   "кнопка E"
    "job.truckdriver.help.loadunloadtext"   :   "Загрузить/разгрузить грузовик (нужно быть в грузовике)"


/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "job.docker"                        :   "портовый рабочий"
    "job.docker.letsgo"                 :   "[DOCKER] Отправляйтесь в офис City Port."
    "job.docker.already"                :   "[DOCKER] Ты уже работаешь портовым рабочим."
    "job.docker.now"                    :   "[DOCKER] Ты стал портовым рабочим. Добро пожаловать... в ад! Аха-ха..."
    "job.docker.takeboxandcarry"        :   "[DOCKER] Бери ящик и неси к грузовику."
    "job.docker.not"                    :   "[DOCKER] Вы не работаете портовым рабочим."
    "job.docker.takebox"                :   "[DOCKER] Возьми ящик."
    "job.docker.havebox"                :   "[DOCKER] Ты уже несёшь ящик. Тебе мало что ли?"
    "job.docker.tookbox"                :   "[DOCKER] Ты взял ящик. Теперь неси его к грузовику."
    "job.docker.haventbox"              :   "[DOCKER] Ты не брал ящик."
    "job.docker.dropped"                :   "[DOCKER] Ты уронил ящик."
    "job.docker.presscapslock"          :   "Нажми CAPS LOCK для включения режима ходьбы."
    "job.docker.gotowarehouse"          :   "[DOCKER] Неси ящик к грузовику."
    "job.docker.nicejob"                :   "[DOCKER] Ты принёс ящик. Твой заработок $%.2f."

    "job.docker.help.title"             :   "Список команд, доступных портовому рабочему:"
    "job.docker.help.job"               :   "Устроиться на работу портовым рабочим"
    "job.docker.help.jobleave"          :   "Уволиться с работы"
    "job.docker.help.take"              :   "Взять ящик"
    "job.docker.help.put"               :   "Положить ящик на склад"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "job.fueldriver"                                        : "водитель бензовоза"
    "job.fueldriver.letsgo"                                 : "[FUEL] Отправляйтесь к штаб-квартире Trago Oil в Ойстер-Бэй."
    "job.fueldriver.needlevel"                              : "[FUEL] Водителем бензовоза можно устроиться начиная с уровня %d."
    "job.fueldriver.already"                                : "[FUEL] Вы уже работает водителем бензовоза."
    "job.fueldriver.now"                                    : "[FUEL] Вы стали водителем бензовоза!"
    "job.fueldriver.sitintotruck"                           : "[FUEL] Вы взяли маршрут. Садитесь в бензовоз."
    "job.fueldriver.not"                                    : "[FUEL] Вы не работаете водителем бензовоза."
    "job.fueldriver.badworker"                              : "[FUEL] Увы, но нам нужны только ответственные водители."
    "job.fueldriver.badworker.onleave"                      : "[FUEL] Плохой из тебя работник."
    "job.fueldriver.goodluck"                               : "[FUEL] Удачи тебе! Приходи, если нужна работа."
    "job.fueldriver.needfueltruck"                          : "[FUEL] Вам нужен бензовоз."
    "job.fueldriver.truck.loaded"                           : "[FUEL] Бензовоз заполнен на %d из 16000. Развезите топливо по заправкам."
    "job.fueldriver.truck.empty"                            : "[FUEL] Бензовоз пуст. Отправляйтесь к топливному хранилищу в Южный Милвилл для загрузки (жёлтая метка на радаре)."
    "job.fueldriver.truck.toload"                           : "[FUEL] Отправляйтесь к топливному хранилищу в Южный Милвилл для загрузки (жёлтая метка на радаре)."
    "job.fueldriver.driving"                                : "[FUEL] Остановите бензовоз."
    "job.fueldriver.truck.loading"                          : "[FUEL] Идёт загрузка. Ожидайте..."
    "job.fueldriver.truck.unloading"                        : "[FUEL] Идёт разгрузка. Ожидайте..."
    "job.fueldriver.truck.alreadyloaded"                    : "[FUEL] Бензовоз уже заполнен."
    "job.fueldriver.truck.fullloaded"                       : "[FUEL] Бензовоз заполнен на 16000 из 16000. Развезите топливо по заправкам."
    "job.fueldriver.truck.fuelnotenough"                    : "[FUEL] Недостаточно топлива. Отправляйтесь к топливному хранилищу для загрузки (жёлтая метка на радаре)"

    "job.fueldriver.alreadybeenhere"                        : "[FUEL] Вы уже были здесь. Направляйтесь к другой заправке."
    "job.fueldriver.truck.parking"                          : "[FUEL] Хорошая работа! Возвращайтесь к штаб-квартире Trago Oil в Ойстер-Бэй за деньгами."
    "job.fueldriver.truck.unloadingcompletedtruckisloaded"  : "[FUEL] Разгрузка выполнена. Бензовоз заполнен на %d из 16000. Направляйтесь к следующей заправке."
    "job.fueldriver.truck.unloadingcompletedfuelnotenough"  : "[FUEL] Разгрузка выполнена. Топливо закончилось. Отправляйтесь к топливному хранилищу для загрузки (жёлтая метка на радаре)"
    "job.fueldriver.truck.topark"                           : "[FUEL] Чтобы припарковать бензовоз, отправляйтесь к штаб-квартире Trago Oil в Ойстер-Бэй."
    "job.fueldriver.completedelivery"                       : "[FUEL] Развезите топливо по всем заправкам."
    "job.fueldriver.continuedelivery"                       : "[FUEL] Продолжите доставку топлива по заправкам."
    "job.fueldriver.ifyouwantstart"                         : "[FUEL] Вы работаете водителем бензовоза. Если хотите выйти в рейс - возьмите маршрут в штаб-квартире Trago Oil в Ойстер-Бэй."
    "job.fueldriver.nicejob"                                : "[FUEL] Отличная работа! Вы заработали $%.2f."
    "job.fueldriver.routelist.title"                        : "[FUEL] ========== Маршрутный лист =========="
    "job.fueldriver.routelist.completed"                    : "[FUEL] %d. Заправка в %s - доставлено"
    "job.fueldriver.routelist.waiting"                      : "[FUEL] %d. Заправка в %s - ожидается"
    "job.fueldriver.truck.loadedto"                         : "[FUEL] Бензовоз заполнен на %d из 16000."

    "job.fueldriver.help.title"                             : "Список команд, доступных водителю бензовоза:"

    "job.fueldriver.help.job"                               : "кнопка E"
    "job.fueldriver.help.jobtext"                           : "Устроиться на работу водителем бензовоза (в штаб-квартире Ойстер-Бэй)"
    "job.fueldriver.help.jobleave"                          : "кнопка Q"
    "job.fueldriver.help.jobleavetext"                      : "Уволиться с работы (в штаб-квартире Ойстер-Бэй)"
    "job.fueldriver.help.loadunload"                        : "кнопка E"
    "job.fueldriver.help.loadunloadtext"                    : "Загрузить/разгрузить бензовоз"
    "job.fueldriver.help.check"                             : "Проверить загруженность бензовоза"
    "job.fueldriver.help.list"                              : "Посмотреть маршрутный лист"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "job.realtor"                   :   "риелтор"
    "job.realtor.not"               :   "Вы не риелтор."
    "job.realtor.sendinvoice"       :   "Вы отправили запрос на оплату покупки дома."
    "job.realtor.receivedinvoice"   :   "Вы получили запрос на оплату покупки дома."
    "job.realtor.boughthouse"       :   "Поздравляем с приобретением дома!."
    "job.realtor.customerpaid"      :   "Покупатель подтвердил оплату. Дом продан. "
    "job.realtor.youcantbuy"        :   "Вы должны оплатить покупку дома."
    "job.realtor.customer"          :   "Покупатель не подтвердил оплату."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "job.porter"                    :   "грузчик"
    "job.porter.letsgo"             :   "[PORTER] Отправляйтесь внутрь здания вокзала в Dipton."
    "job.porter.already"            :   "[PORTER] Ты уже работаешь грузчиком."
    "job.porter.now"                :   "[PORTER] Ты стал грузчиком. Давай за работу!"
    "job.porter.takeboxandcarry"    :   "[PORTER] Бери ящик и неси к вагону."
    "job.porter.not"                :   "[PORTER] Вы не работаете грузчиком."
    "job.porter.takebox"            :   "[PORTER] Иди и возьми ящик."
    "job.porter.havebox"            :   "[PORTER] Ты уже несёшь ящик. Тебе мало что ли?"
    "job.porter.tookbox"            :   "[PORTER] Ты взял ящик. Теперь неси его к вагону."
    "job.porter.haventbox"          :   "[PORTER] Ты не брал ящик."
    "job.porter.gotowarehouse"      :   "[PORTER] Иди к вагону."
    "job.porter.nicejob"            :   "[PORTER] Ты принёс ящик. Твой заработок $%.2f."

    "job.porter.help.title"         :   "Список команд, доступных грузчику:"
    "job.porter.help.job"           :   "Устроиться на работу грузчиком"
    "job.porter.help.jobleave"      :   "Уволиться с работы"
    "job.porter.help.take"          :   "Взять ящик"
    "job.porter.help.put"           :   "Положить ящик к вагону"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */



/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "telephone0"  : "Кингстон. Недалеко от тюрьмы"
    "telephone1"  : "Диптон. Во дворах напротив вокзала"
    "telephone2"  : "Риверсайд"
    "telephone3"  : "Диптон. Около автозаправки"
    "telephone4"  : "Диптон. Дорога к автозаправке. Парные будки"
    "telephone5"  : "Диптон. Дорога к автозаправке. Парные будки"
    "telephone6"  : "Кингстон. Около магазина оружия"
    "telephone7"  : "Кингстон. Западная часть самой северной улицы"
    "telephone8"  : "Кингстон. Около закусочной «Эмпайр Дайнер»"
    "telephone9"  : "Кингстон. Въезд в тоннель Аптаун. Парные будки"
    "telephone10" : "Кингстон. Въезд в тоннель Аптаун. Парные будки"
    "telephone11" : "Кингстон. Въезд в тоннель Аптаун"
    "telephone12" : "Кингстон. По улице от тоннеля к Ривер-Стрит"
    "telephone13" : "Кингстон. Около бара «Зелёный холм»"
    "telephone14" : "Кингстон. Ривер-Стрит, напротив стадиона. Парные будки"
    "telephone15" : "Кингстон. Ривер-Стрит, напротив стадиона. Парные будки"
    "telephone16" : "Кингстон. Центр Ривер-Стрит. Парные будки"
    "telephone17" : "Кингстон. Центр Ривер-Стрит. Парные будки"
    "telephone18" : "Кингстон. Ривер-Стрит, верх лестницы к тоннелю Аптаун. Парные будки"
    "telephone19" : "Кингстон. Ривер-Стрит, верх лестницы к тоннелю Аптаун. Парные будки"
    "telephone20" : "Кингстон. Восточная часть Ривер-Стрит"
    "telephone21" : "Гринфилд. Шоссе"
    "telephone22" : "Гринфилд. Оук-Стрит"
    "telephone23" : "Кингстон. Стадион. Парные будки"
    "telephone24" : "Кингстон. Стадион. Парные будки"
    "telephone25" : "Гринфилд. Около автозаправки"
    "telephone26" : "Гринфилд. Около закусочной «Эмпайр Дайнер»"
    "telephone27" : "Гринфилд. Парк"
    "telephone28" : "Гринфилд. Около парка"
    "telephone29" : "Хантерс-Пойнт. Север Эвергрин-Стрит"
    "telephone30" : "Хантерс-Пойнт. Недалеко от трамплина из досок"
    "telephone31" : "Хантерс-Пойнт. Около небольшого моста над метро"
    "telephone32" : "Хантерс-Пойнт. Центр района"
    "telephone33" : "Сэнд-Айленд. Около закусочной «Эмпайр Дайнер»"
    "telephone34" : "Хантерс-Пойнт. Граница с районом Сэнд-Айленд"
    "telephone35" : "Сэнд-Айленд. Под эстакадой метро"
    "telephone36" : "Сэнд-Айленд. Запад"
    "telephone37" : "Сэнд-Айленд. Около улицы Мизери-Лейн"
    "telephone38" : "Хилвуд"
    "telephone39" : "Аптаун. Въезд в тоннель Аптауна"
    "telephone40" : "Аптаун. Около дома 174"
    "telephone41" : "Аптаун. Вид на реку Калвер. Парные будки"
    "telephone42" : "Аптаун. Вид на реку Калвер. Парные будки"
    "telephone43" : "Аптаун. Авеню"
    "telephone44" : "Аптаун. Нижняя улица, ведущая в Сауспорт"
    "telephone45" : "Аптаун. Около здания управления по регулированию цен. Парные будки"
    "telephone46" : "Аптаун. Около здания управления по регулированию цен. Парные будки"
    "telephone47" : "Аптаун. Около здания главного госпиталя"
    "telephone48" : "Маленькая Италия. Около автосалона Diamond Motors"
    "telephone49" : "Маленькая Италия. Бульвар"
    "telephone50" : "Маленькая Италия. Около бара «У Фредди»"
    "telephone51" : "Маленькая Италия. Около магазина Джузеппе"
    "telephone52" : "Маленькая Италия. Дорога в Ист-Сайд"
    "telephone53" : "Ист-Сайд. Граница с районом Маленькая Италия"
    "telephone54" : "Ист-Сайд. Около магазина одежды Dipton Apparel"
    "telephone55" : "Маленькая Италия. Перекрёсток недалеко от квартиры Джо"
    "telephone56" : "Маленькая Италия. Недалеко от квартиры семьи Скалетта"
    "telephone57" : "Северный Милвилл. У парковки Car Rental"
    "telephone58" : "Маленькая Италия. Недалеко от квартира Марии Аньелло"
    "telephone59" : "Маленькая Италия. Граница с районом Чайнатаун"
    "telephone60" : "Чайнатаун. Запад"
    "telephone61" : "Чайнатаун. Восток"
    "telephone62" : "Чайнатаун. Центр района. Парные будки"
    "telephone63" : "Чайнатаун. Центр района. Парные будки"
    "telephone64" : "Ойстер-Бэй. Кафе на холме"
    "telephone65" : "Южный Милвилл. Около топливной станции"
    "telephone66" : "Южный Милвилл. Около здания типографии"
    "telephone67" : "Ойстер-Бэй. Около здания топливной компании Trago Oil"
    "telephone68" : "Ойстер-Бэй. Около магазина оружия"
    "telephone69" : "Сауспорт. Около автомастерской Чарли"
    "telephone70" : "Сауспорт. Палисад-Стрит"
    "telephone71" : "Сауспорт. Парные будки"
    "telephone72" : "Сауспорт. Парные будки"
    "telephone73" : "Мидтаун. Автобусная остановка"
    "telephone74" : "Мидтаун. Около здания Большого Имперского банка"
    "telephone75" : "Мидтаун. Около церкви"
    "telephone76" : "Мидтаун. Рядом с ателье Вэнджела"
    "telephone77" : "Ист-Сайд. Рядом с рестораном «Мальтийский сокол»"
    "telephone78" : "Ист-Сайд. Бульвар. Парные будки"
    "telephone79" : "Ист-Сайд. Бульвар. Парные будки"
    "telephone80" : "Ист-Сайд. Напротив автомастерской"
    "telephone81" : "Сауспорт. Дорога к тоннелю Сауспорта"
    "telephone82" : "Ист-Сайд. Около Линкольн-парка"
    "telephone83" : "Вест-Сайд. Задний двор торгового центра «Аркада»"
    "telephone84" : "Вест-Сайд. Напротив таксопарка"
    "telephone85" : "Аптаун. Рядом со скульптурой в виде иероглифа"
    "telephone86" : "Аптаун. Задний двор здания парковки"
    "telephone87" : "Аптаун. Около автобусной станции. Парные будки"
    "telephone88" : "Аптаун. Около автобусной станции. Парные будки"
    "telephone89" : "Аптаун. У небоскрёба с видом на здание Полицейского Департамента"
    "telephone90" : "Аптаун. Около здания парковки и Большого Верхнего моста. Парные будки"
    "telephone91" : "Аптаун. Около здания парковки и Большого Верхнего моста. Парные будки"
    "telephone92" : "Аптаун. Напротив здания Полицейского Департамента"
    "telephone93" : "Аптаун. Около арки метро по дороге в Маленькую Италию"

    "telephone94" :  "Порт. Офис порта"
    "telephone95" :  "Маленькая Италия. Квартира Джо"
    "telephone96" :  "Северный Милвилл. Бар «Дрэгстрип»"
    "telephone97" :  "Маленькая Италия. Бар «У Фредди»"
    "telephone98" :  "Мидтаун. Ресторан «Мальтийский сокол»"
    "telephone99" :  "Мидтаун. Ателье Вэнджела"
    "telephone100" : "Вест-Сайд. Ресторан «Мона Лиза»"
    "telephone101" : "Хантерс-Пойнт. Бар «Одинокая звезда»"
    "telephone102" : "Сэнд-Айленд. Ресторан «Steaks & Chops»"
    "telephone103" : "Кингстон. Бар «Зелёный холм»"
    "telephone104" : "Гринфилд. Вилла Скалетта"
    "telephone105" : "Аптаун. Квартира Вито"
    "telephone106" : "Ойстер-Бэй. Квартира Марти"
    "telephone107" : "Сауспорт. Офис ростовщика"

    "telephone108" : "Ойстер-Бэй. Empire Diner"
    "telephone109" : "Сэнд-Айленд. Empire Diner"
    "telephone110" : "Кингстон. Empire Diner"
    "telephone111" : "Хайбрук. Empire Diner"
    "telephone112" : "Гринфилд. Empire Diner"
    "telephone113" : "Вест-Сайд. Stella's Diner"
    "telephone114" : "Маленькая Италия. Stella's Diner"
    "telephone115" : "Сауспорт. Illia's Bar"

    "telephone116" : "Сауспорт. Магазин одежды Dipton Apparel"
    "telephone117" : "Кингстон. Магазин одежды Dipton Apparel (Север)"
    "telephone118" : "Кингстон. Магазин одежды Dipton Apparel (Юг)"
    "telephone119" : "Вест-Сайд. Магазин одежды Dipton Apparel"
    "telephone120" : "Аптаун. Магазин одежды Dipton Apparel"
    "telephone121" : "Чайнатаун. Магазин одежды Dipton Apparel"
    "telephone122" : "Ист-Сайд. Магазин одежды Dipton Apparel"
    "telephone123" : "Ойстер-Бэй. Магазин одежды Dipton Apparel (Север)"
    "telephone124" : "Ойстер-Бэй. Магазин одежды Dipton Apparel (Юг)"
    "telephone125" : "Маленькая Италия. Магазин одежды Dipton Apparel (Запад)"
    "telephone126" : "Маленькая Италия. Магазин одежды Dipton Apparel (Восток)"
    "telephone127" : "Хантерс-Пойнт. Магазин одежды Магазин одежды Dipton Apparel"
    "telephone128" : "Сэнд-Айленд. Магазин одежды Dipton Apparel"

    "telephone129" : "Сэнд-Айленд. Магазин оружия"
    "telephone130" : "Кингстон. Магазин оружия"
    "telephone131" : "Риверсайд. Магазин оружия"
    "telephone132" : "Ойстер-Бэй. Магазин оружия (Юг)"
    "telephone133" : "Ойстер-Бэй. Магазин оружия (Север)"
    "telephone134" : "Вест-Сайд. Магазин оружия"
    "telephone135" : "Сауспорт. Магазин оружия"
    "telephone136" : "Ист-Сайд. Магазин оружия"
    "telephone137" : "Маленькая Италия. Магазин оружия (Запад)"
    "telephone138" : "Маленькая Италия. Магазин оружия (Восток)"

    "telephone139" : "Диптон. Автозаправка"
    "telephone140" : "Гринфилд. Автозаправка"
    "telephone141" : "Сэнд-Айленд. Автозаправка"
    "telephone142" : "Маленькая Италия. Автозаправка (Восток)"
    "telephone143" : "Маленькая Италия. Автозаправка (Запад)"
    "telephone144" : "Ойстер-Бэй. Автозаправка"
    "telephone145" : "Ист-Сайд. Автозаправка"
    "telephone146" : "Вест-Сайд. Автозаправка"

    "telephone147" : "Кингстон. Army Navy"


    "telephone.findphone" : "В течение 20 секунд на радаре отображается метка ближайшей телефонной будки."
    "telephone.findalready" : "Ближайшая телефонная будка уже отображена на радаре."
    "telephone.needphone"   : "Чтобы позвонить, нужно найти телефонный аппарат."
    "telephone.neednumber"  : "Нужно набрать правильный телефонный номер. Образец: 555-XXXX"
    "telephone.youcall"     : "Вы позвонили по номеру %s."
    "telephone.incorrect"   : "Неправильно набран номер. Образец: 555-XXXX"
    "telephone.notregister" : "Набранный телефонный номер не зарегистрирован в сети."
    "telephone.notenoughmoney" : "У вас недостаточно денег для звонка."

    "policeAlarm1"      : "Риверсайд. Вызов по кнопке"
    "policeAlarm2"      : "Кингстон. Ривер-Стрит, напротив стадиона. Вызов по кнопке"
    "policeAlarm3"      : "Кингстон. Центр Ривер-Стрит. Вызов по кнопке"
    "policeAlarm4"      : "Кингстон. Скульптура всадника. Вызов по кнопке"
    "policeAlarm5"      : "Кингстон. Стадион. Вызов по кнопке"
    "policeAlarm6"      : "Хантерс-Пойнт. Север Эвергрин-Стрит. Вызов по кнопке"
    "policeAlarm7"      : "Хантерс-Пойнт. Около бара «Одинокая звезда». Вызов по кнопке"
    "policeAlarm8"      : "Ист-Сайд. Бульвар. Вызов по кнопке"
    "policeAlarm9"      : "Вест-Сайд. Около автозаправки. Вызов по кнопке"
    "policeAlarm10"     : "Вест-Сайд. Около автомастерской. Вызов по кнопке"
    "policeAlarm11"     : "Вест-Сайд. Около Линкольн-парка. Юго-запад. Вызов по кнопке"
    "policeAlarm12"     : "Вест-Сайд. Около Линкольн-парка. Северо-запад. Вызов по кнопке"
    "policeAlarm13"     : "Аптаун. Напротив автобусной остановки. Вызов по кнопке"
    "policeAlarm14"     : "Вест-Сайд. Север. Вызов по кнопке"
    "policeAlarm15"     : "Ист-Сайд. Бульвар. Вызов по кнопке"
    "policeAlarm16"     : "Ист-Сайд. Около Линкольн-парка. Серверо-восток. Вызов по кнопке"
    "policeAlarm17"     : "Ист-Сайд. Около Линкольн-парка. Восточный въезд. Вызов по кнопке"
    "policeAlarm18"     : "Ист-Сайд. Около Линкольн-парка. Восток. Вызов по кнопке"
    "policeAlarm19"     : "Ист-Сайд. Около Линкольн-парка. Юго-восток. Вызов по кнопке"
    "policeAlarm20"     : "Ист-Сайд. Поворот около автомастерской. Вызов по кнопке"
    "policeAlarm21"     : "Ист-Сайд. Парковка такси. Вызов по кнопке"
    "policeAlarm22"     : "Ист-Сайд. Поворот в район Маленькая Италия. Вызов по кнопке"
    "policeAlarm23"     : "Маленькая Италия. Около бара «У Фредди». Вызов по кнопке"
    "policeAlarm24"     : "Маленькая Италия. Центр. Вызов по кнопке"
    "policeAlarm25"     : "Маленькая Италия. Около квартиры Джо. Вызов по кнопке"
    "policeAlarm26"     : "Маленькая Италия. Восток. У автозаправки. Вызов по кнопке"
    "policeAlarm27"     : "Маленькая Италия. Восток. Вызов по кнопке"
    "policeAlarm28"     : "Маленькая Италия. Восток. Вызов по кнопке"
    "policeAlarm29"     : "Маленькая Италия. Восток. Около автобусной остановки. Вызов по кнопке"
    "policeAlarm30"     : "Маленькая Италия. Восток. Недалеко от квартира Марии Аньелло. Вызов по кнопке"
    "policeAlarm31"     : "Маленькая Италия. Граница с районом Чайнатаун. Вызов по кнопке"
    "policeAlarm32"     : "Чайнатаун. Запад. Вызов по кнопке"
    "policeAlarm33"     : "Чайнатаун. Центр. Вызов по кнопке"
    "policeAlarm34"     : "Чайнатаун. Метро. Вызов по кнопке"
    "policeAlarm35"     : "Ойстер-Бэй. Около борделя «Эдемский сад». Вызов по кнопке"
    "policeAlarm36"     : "Маленькая Италия. Недалеко от квартиры семьи Скалетта. Вызов по кнопке"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "metro.toofaraway"                  : "[МЕТРО] Вы находитесь слишком далеко от станции!"
    "metro.notenoughmoney"              : "[МЕТРО] У вас недостаточно денег!"
    "metro.pay"                         : "[МЕТРО] Вы заплатили $%.2f за проезд."
    "metro.arrived"                     : "[МЕТРО] Вы прибыли на станцию %s."
    "metro.herealready"                 : "[МЕТРО] Вы и так уже здесь."
    "metro.notexist"                    : "[МЕТРО] Выбранной станции метро не существует."
    "metro.nocar"                       : "[МЕТРО] Метро - не паром. Выйдите из авто."

    "metro.listStations.title"          : "Список доступных станций метро:"
    "metro.listStations.station"        : "Станция #%d - %s"
    "metro.listStations.station.closed" : "Станция #%d - %s (закрыта)"

    "metro.station.closed.maintaince"   : "Станция %s закрыта по техническим причинам. Пожалуйста, воспользуйтесь другими станциями или используйте общественный транспорт."

    "metro.help.title"                  : "Найди ближайшую станцию для поездок на метро: /subway"
    "metro.help.subway"                 : "Отправиться на станцию по id"
    "metro.help.subwayList"             : "Посмотреть список всех станций"
    "metro.help.sub"                    : "Аналог /subway id"
    "metro.help.metro"                  : "Аналог /subway id"

    "metro.station.nearest.showblip"    : "[МЕТРО] Ближайшая станция (%s) отмечена на карте жёлтым маркером."

    "metro.dipton"      : "Диптон"
    "metro.uptown"      : "Аптаун"
    "metro.chinatown"   : "Чайнатаун"
    "metro.southport"   : "Сауспорт"
    "metro.westside"    : "Вест-Сайд"
    "metro.sandisland"  : "Сэнд-Айленд"
    "metro.kingston"    : "Кингстон"

    "metro.gui.window"   : "Метро Эмпайр-Бэй"
    "metro.gui.youhere"  : "Станция %s"
    "metro.gui.price"    : "Цена поздки: $%.2f"
    "metro.gui.close"    : "Закрыть"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "bank.letsgo"                       :   "Отправляйтесь к зданию Grand Imperial Bank в Мидтауне."
    "bank.deposit.minimum"              :   "Вы не можете положить эту сумму. Минимальная сумма вклада составляет $100."
    "bank.deposit.notenough"            :   "Вы не можете положить эту сумму: недостаточно наличных денег."
    "bank.withdraw.minimum"             :   "Вы не можете снять эту сумму. Минимальная сумма снятия составляет $100."
    "bank.withdraw.notenough"           :   "Вы не можете снять эту сумму: недостаточно средств на балансе."
    "bank.provideamount"                :   "Вам необходимо указать сумму."
    "bank.help.commandslist"            :   "Список доступных команд для Grand Imperial Bank:"

    "help.bank.account"                 :   "Посмотреть информацию о своём счёте в банке"
    "help.bank.deposit"                 :   "Положить на счёт указанную сумму"
    "help.bank.depositall"              :   "Положить на счёт все наличные деньги"
    "help.bank.withdraw"                :   "Снять со счёта указанную сумму"
    "help.bank.withdrawall"             :   "Снять со счёта все деньги"

    "help.cmd.bank.account"             :   "/bank account"
    "help.cmd.bank.deposit"             :   "/bank deposit сумма"
    "help.cmd.bank.depositall"          :   "/bank deposit all"
    "help.cmd.bank.withdraw"            :   "/bank withdraw сумма"
    "help.cmd.bank.withdrawall"         :   "/bank withdraw all"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "organizations.hobos.trash.toofar"  : "Вы далеко от мусорного контейнера!"
    "organizations.hobos.tired"         : "Вы устали, передохните."
    "organizations.hobos.trash.found"   : "Вы нашли $%.2f. Теперь у вас $%s."
    "organizations.unemployed.income"   : "Вы получили $%.2f в качестве пособия по безработице."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "parking.needEnterPlate"    : "Необходимо указать номер автомобиля."
    "parking.checkPlate"        : "Проверьте правильность указанного номера автомобиля."
    "parking.peoopleInside"     : "Невозможно эвакуировать авто на штрафстоянку с людьми внутри."
    "parking.alreadyParking"    : "Автомобиль уже находится на штрафстоянке."
    "parking.complete"          : "Автомобиль эвакуирован на штрафстоянку."
    "parking.noFreeSpace"       : "На штрафстоянке нет свободных мест."
    "parking.carNotParked"      : "Автомобиль с номером %s отсутствует на штрафстоянке."
    "parking.notenoughmoney"    : "У вас недостаточно денег."
    "parking.notYourCar"        : "Этот автомобиль вам не принадлежит."
    "parking.free"              : "Вы забрали автомобиль со штрафстоянки."
    "parking.pay"               : "Чтобы забрать автомобиль, нужно заплатить $%d: /unpark"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "rentcar.goto"          : "Отправляйтесь на парковку авто, предоставляемых в аренду, в North Millville."
    "rentcar.notrent"       : "Этот автомобиль нельзя арендовать."
    "rentcar.notenough"     : "У вас недостаточно денег."
    "rentcar.rented"        : "Вы арендовали этот автомобиль. Отказаться от аренды: /unrent"
    "rentcar.refused"       : "Вы отказались от аренды всех автомобилей. Благодарим за выбор North Millville Car Rental!"
    "rentcar.canrent"       : "Вы можете взять этот автомобиль в аренду за $%.2f за 10 игровых минут ($%.2f в час). Если согласны: /rent"
    "rentcar.cantrent"      : "У вас закончились деньги, аренда приостановлена. Пожалуйста, покиньте автомобиль."
    "rentcar.paidcar"       : "Вы заплатили за аренду автомобиля $%.2f. Ваш баланс: $%s."

    "rentcar.help.title"    : "Список команд, доступных для аренды автомобилей:"
    "rentcar.help.rent"     : "Арендовать автомобиль (нужно быть в автомобиле)"
    "rentcar.help.refuse"   : "Отказаться от аренды всех автомобилей"
    // Для GUI
    "rentcar.gui.window"   : "Аренда автомобиля"
    "rentcar.gui.buttonRent"   : "Арендовать"
    "rentcar.gui.buttonRefuse"   : "Отказаться"
    "rentcar.gui.canrent"   : "Вы можете взять этот автомобиль в аренду.\nЦена: $%.2f за 10 игровых минут ($%.2f в час)."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.carshop.gotothere"     : "Если вы хотите купить авто, отправляйтесь в Diamond Motors или Bad Guy Motors!"
    "shops.carshop.welcome"       : "Добро пожаловать, %s! Если вы хотите купить авто, выберите модель через: /car list"
    "shops.carshop.nofreespace"   : "К сожалению, на парковке нету свободных мест. Зайдите позже."
    "shops.carshop.money.error"   : "К сожалению, у вас недостаточно денег."
    "shops.carshop.selectmodel"   : "Вы можете посмотреть модели авто и их цены, используя: /car list"
    "shops.carshop.list.title"    : "Выберите модель, которая вам нравится, и купите её, используя: /car buy MODELID"
    "shops.carshop.list.entry"    : " - Модель #%d, «%s». Цена: $%.2f"
    "shops.carshop.success"       : "Поздравляем! Вы успешно купили автомобиль. Счастливого пути!"
    "shops.carshop.help.title"    : "Список команд, доступных для магазина авто:"
    "shops.carshop.help.list"     : "Посмотреть список авто, доступных для покупки"
    "shops.carshop.help.buy"      : "Купить авто с указанной моделью"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.clothesshop.gotothere"     : "Если вы хотите купить одежду, отправляйтесь в магазин одежды Vangel's в Мидтауне!"
    "shops.clothesshop.money.error"   : "К сожалению, у вас недостаточно денег."
    "shops.clothesshop.selectskin"    : "Вы можете посмотреть одежду и цены на неё, нажав клавишу E."
    "shops.clothesshop.list.title"    : "Выберите одежду, которая вам нравится, и купите её, используя: /skin buy skinID"
    "shops.clothesshop.list.entry"    : " - Модель #%d, '%s'. Цена: $%.2f"
    "shops.clothesshop.success"       : "Отличный выбор! Ждём Вас снова в нашем магазине!"

    "shops.clothesshop.id4"        : "Костюм с шляпой"
    "shops.clothesshop.id6"        : "Костюм с жилеткой и шляпой"
    "shops.clothesshop.id10"       : "Повседневная одежда"
    "shops.clothesshop.id48"       : "Костюм азиатский"
    "shops.clothesshop.id74"       : "Костюм"
    "shops.clothesshop.id90"       : "Светлое пальто с шляпой"
    "shops.clothesshop.id91"       : "Чёрный плащ с шляпой"
    "shops.clothesshop.id92"       : "Чёрное пальто"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.fuelstations.toofar"             : "Вы слишком далеко от заправки!"
    "shops.fuelstations.farfromvehicle"     : "Вы находитесь не у автомобиля."
    "shops.fuelstations.stopyourmoves"      : "Остановите автомобиль, чтобы заправиться."
    "shops.fuelstations.fueltank.check"     : "В баке: %.2f литров."
    "shops.fuelstations.fueltank.full"      : "[FUEL] Бак полон!"
    "shops.fuelstations.money.notenough"    : "[FUEL] Недостаточно денег. Для оплаты требуется $%.2f, а у вас только $%s."
    "shops.fuelstations.fuel.payed"         : "[FUEL] Вы заплатили $%.2f за %.2f литров. Ваш баланс $%s. Будем рады видеть Вас снова!"

    "shops.fuelstations.help.fuelup"        : "Заправить автомобиль"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.repairshop.toofar"             : "Вы слишком далеко от автомастерской!"
    "shops.repairshop.money.notenough"    : "[АВТОМАСТЕРСКАЯ] Недостаточно денег. Для оплаты ремонта требуется $%.2f, а у вас только $%s."
    "shops.repairshop.repair.payed"       : "[АВТОМАСТЕРСКАЯ] Ремонт автомобиля обошёлся Вам в $%.2f. Ваш баланс $%s. Будем рады видеть вас снова!"
    "shops.repairshop.repaint.payed"      : "[АВТОМАСТЕРСКАЯ] Покраска автомобиля обошлась Вам в $%.2f. Ваш баланс $%s. Будем рады видеть вас снова!"
    "shops.repairshop.needwait"           : "[АВТОМАСТЕРСКАЯ] Ваша машина на ремонте. Ожидайте..."
    "shops.repairshop.ownership.wrong"    : "Прости, приятель, но это не твоя машина. Я не буду её перекрашивать."

    "shops.repairshop.help.title"         : "Список команд, доступных в автомастерской:"
    "shops.repairshop.help.repair"        : "Починить автомобиль"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.restaurant.toofar"               : "[INFO] Вы слишком далеко."
    "shops.restaurant.money.notenough"      : "У вас недостаточно денег для оплаты."
    "shops.restaurant.diner.eat.success"    : "Вы потратили $%.2f на еду."
    "shops.restaurant.bar.drink.success"    : "Вы потратили $%.2f на пиво."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.washstations.toofar"             : "Вы слишком далеко от автомойки!"
    "shops.washstations.money.notenough"    : "[АВТОМОЙКА] Недостаточно денег. Для оплаты мойки авто требуется $%.2f, а у вас только $%s."
    "shops.washstations.wash.payed"         : "[АВТОМОЙКА] Мойка автомобиля обошлась Вам в $%.2f. Ваш баланс $%s. Будем рады видеть вас снова!"
    "shops.washstations.needwait"           : "[АВТОМОЙКА] Ваша машина на мойке. Ожидайте..."

    "shops.washstations.help.title"         : "Список команд, доступных в автомойки:"
    "shops.washstations.help.wash"          : "Помыть автомобиль"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.findcar.hello"       : "[ЗВОНОК] Empire Bay Car Searching Services. Мы найдём ваш автомобиль. Услуга стоит $%.2f. Оплата с банковского счёта."
    "shops.findcar.wait"        : "Идёт поиск... Пожалуйста, подождите..."
    "shops.findcar.found"       : "[ЗВОНОК] Мы нашли ваши автомобили. Благодарим за выбор Empire Bay Car Searching Services."
    "shops.findcar.seemap"      : "Метки всех ваших автомобилей отмечены на карте в течение 90 секунд."
    "shops.findcar.notenough"   : "[ЗВОНОК] К сожалению, у вас недостаточно средств на банковском счёте. До свидания."
    "shops.findcar.help"        : "Для начала поиска напишите в чат 'да' в течение %d секунд."
    "shops.findcar.canceled"    : "[ЗВОНОК] Если понадобится найти авто - звоните нам! Всего хорошего! (повесили трубку)"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "empirecustom.phone.hello"      : "[ЗВОНОК] Рекламное агентство Empire Custom. Мы поможем Вам разместить объявление! Услуга стоит $%.2f."
    "empirecustom.phone.notenough"  : "[ЗВОНОК] К сожалению, денег на вашем банковском счёте недостаточно."
    "empirecustom.phone.enter"      : "Введите текст вашего объявления:"
    "empirecustom.phone.help"       : "Напишите в чат текст объявления в течение %d секунд. Чтобы отказаться - напишите 0 или 'нет'."
    "empirecustom.phone.yourad"     : "Текст: %s"
    "empirecustom.phone.placed"     : "[ЗВОНОК] Ваше объявление будет опубликовано через 1 минуту. Благодарим за выбор Empire Custom. (повесили трубку)"
    "empirecustom.phone.ad"         : "[ОБЪЯВЛЕНИЕ] %s"
    "empirecustom.phone.canceled"   : "[ЗВОНОК] Если захотите разместить объявление - звоните нам! Всего хорошего! (повесили трубку)"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "help.chat"        : "Показать список команд для чата"
    "help.subway"      : "Показать список команд для метро"
    "help.taxi"        : "Показать список команд для такси"
    "help.rentcar"     : "Показать список команд для аренды авто"
    "help.job"         : "Показать список команд для работ. Пример: /help job taxi"
    "help.ban"         : "Показать список команд для банка"
    "help.cars"        : "Показать список команд для авто"
    "help.fuel"        : "Показать список команд для автозаправок"
    "help.repair"      : "Показать список команд для автомастерских"
    "help.report"      : "Сообщить о читере или игроке, нарушающем правила"
    "help.idea"        : "Отправить идею/сообщение разработчикам"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "help.chat.say"         : "(Сказать) Отправить сообщение в локальный чат."
    "help.chat.shout"       : "(Крикнуть) Отправить сообщение в локальный (большого радиуса) чат."
    "help.chat.whisper"     : "(Прошептать) Отправить сообщение ближайшему игроку."
    "help.chat.localooc"    : "Отправить сообщение в локальный нон-РП чат"
    "help.chat.ooc"         : "Отправить сообщение в глобальный нон-РП чат"
    "help.chat.privatemsg"  : "Отправить личное сообщение другому игроку. Например: /pm 3 hello!"
    "help.chat.me"          : "Сообщить о действии вашего персонажа"
    "help.chat.try"         : "Сообщить о попытке выполнения действия со случайным результатом"

    "telephone.findphone"   : "В течение 15 секунд на радаре отображается метка ближайшей телефонной будки."
    "telephone.findalready" : "Ближайшая телефонная будка уже отображена на радаре."
    "telephone.needphone"   : "Чтобы позвонить, нужно найти телефон."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "money.invoice.selectaction"        : "/pay %d, чтобы подтвердить оплату или /cancel %d, чтобы отклонить."
    "money.invoice.distancetoolarge"    : "Расстояние между вами и другим игроком слишком велико!"
    "money.invoice.notenoughmoney"      : "Недостаточно денег для оплаты!"
    "money.invoice.cantpay"             : "%s не может произвести оплату!"
    "money.invoice.needplayerid"        : "Для подтверждения оплаты необходимо указать id игрока."
    "money.invoice.senderoff"           : "Срок действия платежа истёк." //  sender offline

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "vehicle.sell.amount"       : "Вам нужно установить сумму, за которую вы хотите продать авто."
    "vehicle.sell.2passangers"  : "Человек, которому вы хотите продать, должен находиться в одном авто с вами."
    "vehicle.sell.ask"          : "%s предлагает вам приобрести это авто за $%.2f."
    "vehicle.sell.log"          : "Вы предложили %s купить это авто за $%.2f."
    "vehicle.sell.success"      : "Вы успешно продали это авто."
    "vehicle.buy.success"       : "Вы успешно приобрели это авто."
    "vehicle.sell.failure"      : "%s отказался от покупки этого авто."
    "vehicle.buy.failure"       : "Вы отказались от покупки этого авто."
    "vehicle.sell.notowner"     : "Вы не можете продать машину, которая вам не принадлежит."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "bk.disabled"           : "Stuart Booker: Приходи в другое время."
    "bk.goto"               : "[БК] Отправляйтесь к букмекеру на второй этаж бара «У Фредди»."
    "bk.selectsport"        : "[БК] Выберите спорт:"
    "bk.toselectsport"      : "[БК] Для выбора спорта используйте: /bk ID"
    "bk.horseriding"        : "1. Скачки"
    "bk.greyhound"          : "2. Собачьи бега"
    "bk.baseball"           : "3. Бейсбол"

    "bk.selectteam"         : "[БК] Выберите команду:"
    "bk.selecthorse"        : "[БК] Выберите лошадь:"
    "bk.selectdog"          : "[БК] Выберите гончую:"
    "bk.emptylist"          : "[БК] Нет доступных ставок. Приходите в другое время."
    "bk.toselectteam"       : "[БК] Min: $%s, Max: $%s. Сделать ставку: /bk ID СУММА"
    "bk.toselecthorse"      : "[БК] Min: $%s, Max: $%s. Сделать ставку: /bk ID СУММА"
    "bk.toselectdog"        : "[БК] Min: $%s, Max: $%s. Сделать ставку: /bk ID СУММА"

    "bk.needselectsport"    : "[БК] Сначала надо выбрать спорт."
    "bk.notenough"          : "[БК] У вас недостаточно денег."
    "bk.bettoomuch"         : "[БК] Ставка слишком высокая."
    "bk.bettoolow"          : "[БК] Ставка слишком низкая."
    "bk.betnotfound"        : "[БК] Вы можете ставить только на участников из списка."
    "bk.betmade"            : "[БК] Вы поставили $%.2f на победу %s."
    "bk.betwin"             : "[БК] Ваша ставка на «%s» выиграла. Вы заработали $%.2f."
    "bk.betlose"            : "[БК] Ваша ставка на «%s» проиграла. Вы потеряли $%.2f."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */


    "utils.diсe"            : "%s бросил игральный кубик и тот выпал на цифру: %d"
    "utils.hat"             : "В шапке %d шаров. %s вытащил шар номер %d."
    "utils.hatnull"         : "Нужно указать количество участников розыгрыша. Например: /hat 15"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "tutorial.continue" :  "(( Для продолжения нажимайте E ))"
    "turorial.spawn.1"  :  "Эй, друг. Здорово! Я смотрю ты приезжий. Подсказать может чего? Обращайся!"
    "tutorial.spawn.2"  :  "Значит так, это Эмпайр-Бэй - город, в котором мафия правит миром. Чтобы тут выжить - тебе нужны деньги."
    "tutorial.spawn.3"  :  "Зарабатывать деньги можно разными путями. Некоторые идут батрачить, другие связываются с криминалом."
    "tutorial.spawn.4"  :  "Если тебе нужна легальная работа - начни с грузчика в порту или на вокзале. Деньги хоть и не большие, но без штанов не останешься."
    "tutorial.spawn.5"  :  "Можешь поискать работу получше. Передвигаться по городу удобно на такси, метро или арендованном автомобиле."
    "tutorial.spawn.6"  :  "О, кстати, ты можешь купить свой автомобиль, даже несколько. Но придётся потрудиться!"
    "tutorial.spawn.7"  :  "Ну и как бы там ни было, я желаю тебе удачи!"
    "tutorial.spawn.8"  :  "Ах, ты хочешь, чтобы я рассказал тебе информацию еще раз? Хорошо!"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */
    "admin.startRR.message"     :"SERVER: Уважаемые игроки! Сервер будет перезагружен через 15 минут. Пожалуйста, завершите свою работу. Благодарю!"
    "admin.restart.message"     :"Внимание! Сервер будет перезагружен через %i минут."
    "admin.oocEnabled.message"  :"Общий чат был включен администратором!"
    "admin.oocDisabled.message" :"Общий чат был отключен администратором!"
/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */
    "antiflood.message"         :"Антифлуд: Для отправки сообщения подождите еще %i секунд"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "error.title"               : "Ошибка!"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */
    "character.invalid.rpname"      : "Ваш персонаж был создан с неправильным (Нон-РП) именем. Он будет удален. Пожалуйста, пересоздайте персонажа с другими именем и фамилией. Все деньги и другое имущество будет сохранено."
    "character.doesnotexist"        : "Персонаж с указанными данными\nне существует."
    "character.alreadymigrated"     : "Указанный персонаж уже\nбыл мигрирован."
    "character.limitexceeded"       : "Вы не можете создавать\nбольше персонажей."
    "character.alreadyregistered"   : "Указанная пара Имя и Фамилия\nзанята. Пожалуйста, придумайте другие."
    "character.wrongname"           : "Вы указали неправильные Имя\nили Фамилию. Пожалуйста,\nисправьте и попробуйте снова."
    "character.bannednames"         : "Указанное Имя и/или Фамилия\nзапрещены правилами сервера.\nПожалуйста, измените и попробуйте снова."
});
