// russian translation
translation("ru", {
    "language.change.success"           :   "Вы успешно изменили язык интерфейса на русский!"

    "vehicle.owner.warning"             :   "У вас нет ключа от этого автомобиля."

    "client.interface.job"              :   "Работа: %s"
    "client.interface.level"            :   "Уровень: %d"

    "msg.weapons"   : "Это RolePlay сервер. Только банды и мафии могут владеть оружием."

    "general.admins.serial.get"                 : "Cерийный номер игрока %s: %s"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "business.money.income"     : "Вы получили %.2f в качестве дохода от вашего бизнеса «%s»!"
    "business.error.cantbuy"    : "Сейчас у Вас нет возможности купить бизнес!"
    "business.error.faraway"    : "Вы далеко от бизнеса!"
    "business.error.owned"      : "Вы не можете приобрести бизнес, который уже находится в собственности!"
    "business.purchase.success" : "Вы успешно приобрели «%s»!"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "job.leave"                         :   "Вы уволились с работы."
    "job.alreadyhavejob"                :   "У вас уже есть работа: %s."
    "job.checkmyjob"                    :   "Ваша работа: %s."
    "job.unemployed"                    :   "У вас нет работы."
    "job.false"                         :   "Безработный"
    "job.closed"                        :   "Ты пришёл в неподходящее время. Приходи с %s:00 до %s:00."
    "job.toolate"                       :   "Поздновато ты опомнился. Работа уже неактуальна."
    "job.nojob"                         :   "Сейчас нет работы. Приходи в другое время."
    "job.needpassport"                  :   "Для этой работы нужен действительный паспорт."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */



/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */



/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "job.realtor"                   :   "риелтор"
    "job.realtor.not"               :   "Вы не риелтор."
    "job.realtor.sendinvoice"       :   "Вы отправили запрос на оплату покупки дома."
    "job.realtor.receivedinvoice"   :   "Вы получили запрос на оплату покупки дома."
    "job.realtor.boughthouse"       :   "Поздравляем с приобретением дома!."
    "job.realtor.customerpaid"      :   "Покупатель подтвердил оплату. Дом продан. "
    "job.realtor.youcantbuy"        :   "Вы должны оплатить покупку дома."
    "job.realtor.customer"          :   "Покупатель не подтвердил оплату."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */



/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */



/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "telephone0"  : "Кингстон. Недалеко от тюрьмы"
    "telephone1"  : "Диптон. Во дворах напротив вокзала"
    "telephone2"  : "Риверсайд"
    "telephone3"  : "Диптон. Около автозаправки"
    "telephone4"  : "Диптон. Дорога к автозаправке. Парные будки"
    "telephone5"  : "Диптон. Дорога к автозаправке. Парные будки"
    "telephone6"  : "Кингстон. Около магазина оружия"
    "telephone7"  : "Кингстон. Западная часть самой северной улицы"
    "telephone8"  : "Кингстон. Около закусочной «Эмпайр Дайнер»"
    "telephone9"  : "Кингстон. Въезд в тоннель Аптаун. Парные будки"
    "telephone10" : "Кингстон. Въезд в тоннель Аптаун. Парные будки"
    "telephone11" : "Кингстон. Въезд в тоннель Аптаун"
    "telephone12" : "Кингстон. По улице от тоннеля к Ривер-Стрит"
    "telephone13" : "Кингстон. Около бара «Зелёный холм»"
    "telephone14" : "Кингстон. Ривер-Стрит, напротив стадиона. Парные будки"
    "telephone15" : "Кингстон. Ривер-Стрит, напротив стадиона. Парные будки"
    "telephone16" : "Кингстон. Центр Ривер-Стрит. Парные будки"
    "telephone17" : "Кингстон. Центр Ривер-Стрит. Парные будки"
    "telephone18" : "Кингстон. Ривер-Стрит, верх лестницы к тоннелю Аптаун. Парные будки"
    "telephone19" : "Кингстон. Ривер-Стрит, верх лестницы к тоннелю Аптаун. Парные будки"
    "telephone20" : "Кингстон. Восточная часть Ривер-Стрит"
    "telephone21" : "Гринфилд. Шоссе"
    "telephone22" : "Гринфилд. Оук-Стрит"
    "telephone23" : "Кингстон. Стадион. Парные будки"
    "telephone24" : "Кингстон. Стадион. Парные будки"
    "telephone25" : "Гринфилд. Около автозаправки"
    "telephone26" : "Гринфилд. Около закусочной «Эмпайр Дайнер»"
    "telephone27" : "Гринфилд. Парк"
    "telephone28" : "Гринфилд. Около парка"
    "telephone29" : "Хантерс-Пойнт. Север Эвергрин-Стрит"
    "telephone30" : "Хантерс-Пойнт. Недалеко от трамплина из досок"
    "telephone31" : "Хантерс-Пойнт. Около небольшого моста над метро"
    "telephone32" : "Хантерс-Пойнт. Центр района"
    "telephone33" : "Сэнд-Айленд. Около закусочной «Эмпайр Дайнер»"
    "telephone34" : "Хантерс-Пойнт. Граница с районом Сэнд-Айленд"
    "telephone35" : "Сэнд-Айленд. Под эстакадой метро"
    "telephone36" : "Сэнд-Айленд. Запад"
    "telephone37" : "Сэнд-Айленд. Около улицы Мизери-Лейн"
    "telephone38" : "Хилвуд"
    "telephone39" : "Аптаун. Въезд в тоннель Аптауна"
    "telephone40" : "Аптаун. Около дома 174"
    "telephone41" : "Аптаун. Вид на реку Калвер. Парные будки"
    "telephone42" : "Аптаун. Вид на реку Калвер. Парные будки"
    "telephone43" : "Аптаун. Авеню"
    "telephone44" : "Аптаун. Нижняя улица, ведущая в Сауспорт"
    "telephone45" : "Аптаун. Около здания управления по регулированию цен. Парные будки"
    "telephone46" : "Аптаун. Около здания управления по регулированию цен. Парные будки"
    "telephone47" : "Аптаун. Около здания главного госпиталя"
    "telephone48" : "Маленькая Италия. Около автосалона Diamond Motors"
    "telephone49" : "Маленькая Италия. Бульвар"
    "telephone50" : "Маленькая Италия. Около бара «У Фредди»"
    "telephone51" : "Маленькая Италия. Около магазина Джузеппе"
    "telephone52" : "Маленькая Италия. Дорога в Ист-Сайд"
    "telephone53" : "Ист-Сайд. Граница с районом Маленькая Италия"
    "telephone54" : "Ист-Сайд. Около магазина одежды Dipton Apparel"
    "telephone55" : "Маленькая Италия. Перекрёсток недалеко от квартиры Джо"
    "telephone56" : "Маленькая Италия. Недалеко от квартиры семьи Скалетта"
    "telephone57" : "Северный Милвилл. У парковки Car Rental"
    "telephone58" : "Маленькая Италия. Недалеко от квартира Марии Аньелло"
    "telephone59" : "Маленькая Италия. Граница с районом Чайнатаун"
    "telephone60" : "Чайнатаун. Запад"
    "telephone61" : "Чайнатаун. Восток"
    "telephone62" : "Чайнатаун. Центр района. Парные будки"
    "telephone63" : "Чайнатаун. Центр района. Парные будки"
    "telephone64" : "Ойстер-Бэй. Кафе на холме"
    "telephone65" : "Южный Милвилл. Около топливной станции"
    "telephone66" : "Южный Милвилл. Около здания типографии"
    "telephone67" : "Ойстер-Бэй. Около здания топливной компании Trago Oil"
    "telephone68" : "Ойстер-Бэй. Около магазина оружия"
    "telephone69" : "Сауспорт. Около автомастерской Чарли"
    "telephone70" : "Сауспорт. Палисад-Стрит"
    "telephone71" : "Сауспорт. Парные будки"
    "telephone72" : "Сауспорт. Парные будки"
    "telephone73" : "Мидтаун. Автобусная остановка"
    "telephone74" : "Мидтаун. Около здания Большого Имперского банка"
    "telephone75" : "Мидтаун. Около церкви"
    "telephone76" : "Мидтаун. Рядом с ателье Вэнджела"
    "telephone77" : "Ист-Сайд. Рядом с рестораном «Мальтийский сокол»"
    "telephone78" : "Ист-Сайд. Бульвар. Парные будки"
    "telephone79" : "Ист-Сайд. Бульвар. Парные будки"
    "telephone80" : "Ист-Сайд. Напротив автомастерской"
    "telephone81" : "Сауспорт. Дорога к тоннелю Сауспорта"
    "telephone82" : "Ист-Сайд. Около Линкольн-парка"
    "telephone83" : "Вест-Сайд. Задний двор торгового центра «Аркада»"
    "telephone84" : "Вест-Сайд. Напротив таксопарка"
    "telephone85" : "Аптаун. Рядом со скульптурой в виде иероглифа"
    "telephone86" : "Аптаун. Задний двор здания парковки"
    "telephone87" : "Аптаун. Около автобусной станции. Парные будки"
    "telephone88" : "Аптаун. Около автобусной станции. Парные будки"
    "telephone89" : "Аптаун. У небоскрёба с видом на здание Полицейского Департамента"
    "telephone90" : "Аптаун. Около здания парковки и Большого Верхнего моста. Парные будки"
    "telephone91" : "Аптаун. Около здания парковки и Большого Верхнего моста. Парные будки"
    "telephone92" : "Аптаун. Напротив здания Полицейского Департамента"
    "telephone93" : "Аптаун. Около арки метро по дороге в Маленькую Италию"

    "telephone94" :  "Порт. Офис порта"
    "telephone95" :  "Маленькая Италия. Квартира Джо"
    "telephone96" :  "Северный Милвилл. Бар «Дрэгстрип»"
    "telephone97" :  "Маленькая Италия. Бар «У Фредди»"
    "telephone98" :  "Мидтаун. Ресторан «Мальтийский сокол»"
    "telephone99" :  "Мидтаун. Ателье Вэнджела"
    "telephone100" : "Вест-Сайд. Ресторан «Мона Лиза»"
    "telephone101" : "Хантерс-Пойнт. Бар «Одинокая звезда»"
    "telephone102" : "Сэнд-Айленд. Ресторан «Steaks & Chops»"
    "telephone103" : "Кингстон. Бар «Зелёный холм»"
    "telephone104" : "Гринфилд. Вилла Скалетта"
    "telephone105" : "Аптаун. Квартира Вито"
    "telephone106" : "Ойстер-Бэй. Квартира Марти"
    "telephone107" : "Сауспорт. Офис ростовщика"

    "telephone108" : "Ойстер-Бэй. Empire Diner"
    "telephone109" : "Сэнд-Айленд. Empire Diner"
    "telephone110" : "Кингстон. Empire Diner"
    "telephone111" : "Хайбрук. Empire Diner"
    "telephone112" : "Гринфилд. Empire Diner"
    "telephone113" : "Вест-Сайд. Stella's Diner"
    "telephone114" : "Маленькая Италия. Stella's Diner"
    "telephone115" : "Сауспорт. Illia's Bar"

    "telephone116" : "Сауспорт. Магазин одежды Dipton Apparel"
    "telephone117" : "Кингстон. Магазин одежды Dipton Apparel (Север)"
    "telephone118" : "Кингстон. Магазин одежды Dipton Apparel (Юг)"
    "telephone119" : "Вест-Сайд. Магазин одежды Dipton Apparel"
    "telephone120" : "Аптаун. Магазин одежды Dipton Apparel"
    "telephone121" : "Чайнатаун. Магазин одежды Dipton Apparel"
    "telephone122" : "Ист-Сайд. Магазин одежды Dipton Apparel"
    "telephone123" : "Ойстер-Бэй. Магазин одежды Dipton Apparel (Север)"
    "telephone124" : "Ойстер-Бэй. Магазин одежды Dipton Apparel (Юг)"
    "telephone125" : "Маленькая Италия. Магазин одежды Dipton Apparel (Запад)"
    "telephone126" : "Маленькая Италия. Магазин одежды Dipton Apparel (Восток)"
    "telephone127" : "Хантерс-Пойнт. Магазин одежды Магазин одежды Dipton Apparel"
    "telephone128" : "Сэнд-Айленд. Магазин одежды Dipton Apparel"

    "telephone129" : "Сэнд-Айленд. Магазин оружия"
    "telephone130" : "Кингстон. Магазин оружия"
    "telephone131" : "Риверсайд. Магазин оружия"
    "telephone132" : "Ойстер-Бэй. Магазин оружия (Юг)"
    "telephone133" : "Ойстер-Бэй. Магазин оружия (Север)"
    "telephone134" : "Вест-Сайд. Магазин оружия"
    "telephone135" : "Сауспорт. Магазин оружия"
    "telephone136" : "Ист-Сайд. Магазин оружия"
    "telephone137" : "Маленькая Италия. Магазин оружия (Запад)"
    "telephone138" : "Маленькая Италия. Магазин оружия (Восток)"

    "telephone139" : "Диптон. Автозаправка"
    "telephone140" : "Гринфилд. Автозаправка"
    "telephone141" : "Сэнд-Айленд. Автозаправка"
    "telephone142" : "Маленькая Италия. Автозаправка (Восток)"
    "telephone143" : "Маленькая Италия. Автозаправка (Запад)"
    "telephone144" : "Ойстер-Бэй. Автозаправка"
    "telephone145" : "Ист-Сайд. Автозаправка"
    "telephone146" : "Вест-Сайд. Автозаправка"

    "telephone147" : "Кингстон. Army Navy"


    "telephone.findphone" : "В течение 20 секунд на радаре отображается метка ближайшей телефонной будки."
    "telephone.findalready" : "Ближайшая телефонная будка уже отображена на радаре."
    "telephone.needphone"   : "Чтобы позвонить, нужно найти телефонный аппарат."
    "telephone.neednumber"  : "Нужно набрать правильный телефонный номер. Образец: 555-XXXX"
    "telephone.youcall"     : "Вы позвонили по номеру %s."
    "telephone.incorrect"   : "Неправильно набран номер. Образец: 555-XXXX"
    "telephone.notregister" : "Набранный телефонный номер не зарегистрирован в сети."
    "telephone.notenoughmoney" : "У вас недостаточно денег для звонка."

    "policeAlarm1"      : "Риверсайд. Вызов по кнопке"
    "policeAlarm2"      : "Кингстон. Ривер-Стрит, напротив стадиона. Вызов по кнопке"
    "policeAlarm3"      : "Кингстон. Центр Ривер-Стрит. Вызов по кнопке"
    "policeAlarm4"      : "Кингстон. Скульптура всадника. Вызов по кнопке"
    "policeAlarm5"      : "Кингстон. Стадион. Вызов по кнопке"
    "policeAlarm6"      : "Хантерс-Пойнт. Север Эвергрин-Стрит. Вызов по кнопке"
    "policeAlarm7"      : "Хантерс-Пойнт. Около бара «Одинокая звезда». Вызов по кнопке"
    "policeAlarm8"      : "Ист-Сайд. Бульвар. Вызов по кнопке"
    "policeAlarm9"      : "Вест-Сайд. Около автозаправки. Вызов по кнопке"
    "policeAlarm10"     : "Вест-Сайд. Около автомастерской. Вызов по кнопке"
    "policeAlarm11"     : "Вест-Сайд. Около Линкольн-парка. Юго-запад. Вызов по кнопке"
    "policeAlarm12"     : "Вест-Сайд. Около Линкольн-парка. Северо-запад. Вызов по кнопке"
    "policeAlarm13"     : "Аптаун. Напротив автобусной остановки. Вызов по кнопке"
    "policeAlarm14"     : "Вест-Сайд. Север. Вызов по кнопке"
    "policeAlarm15"     : "Ист-Сайд. Бульвар. Вызов по кнопке"
    "policeAlarm16"     : "Ист-Сайд. Около Линкольн-парка. Серверо-восток. Вызов по кнопке"
    "policeAlarm17"     : "Ист-Сайд. Около Линкольн-парка. Восточный въезд. Вызов по кнопке"
    "policeAlarm18"     : "Ист-Сайд. Около Линкольн-парка. Восток. Вызов по кнопке"
    "policeAlarm19"     : "Ист-Сайд. Около Линкольн-парка. Юго-восток. Вызов по кнопке"
    "policeAlarm20"     : "Ист-Сайд. Поворот около автомастерской. Вызов по кнопке"
    "policeAlarm21"     : "Ист-Сайд. Парковка такси. Вызов по кнопке"
    "policeAlarm22"     : "Ист-Сайд. Поворот в район Маленькая Италия. Вызов по кнопке"
    "policeAlarm23"     : "Маленькая Италия. Около бара «У Фредди». Вызов по кнопке"
    "policeAlarm24"     : "Маленькая Италия. Центр. Вызов по кнопке"
    "policeAlarm25"     : "Маленькая Италия. Около квартиры Джо. Вызов по кнопке"
    "policeAlarm26"     : "Маленькая Италия. Восток. У автозаправки. Вызов по кнопке"
    "policeAlarm27"     : "Маленькая Италия. Восток. Вызов по кнопке"
    "policeAlarm28"     : "Маленькая Италия. Восток. Вызов по кнопке"
    "policeAlarm29"     : "Маленькая Италия. Восток. Около автобусной остановки. Вызов по кнопке"
    "policeAlarm30"     : "Маленькая Италия. Восток. Недалеко от квартира Марии Аньелло. Вызов по кнопке"
    "policeAlarm31"     : "Маленькая Италия. Граница с районом Чайнатаун. Вызов по кнопке"
    "policeAlarm32"     : "Чайнатаун. Запад. Вызов по кнопке"
    "policeAlarm33"     : "Чайнатаун. Центр. Вызов по кнопке"
    "policeAlarm34"     : "Чайнатаун. Метро. Вызов по кнопке"
    "policeAlarm35"     : "Ойстер-Бэй. Около борделя «Эдемский сад». Вызов по кнопке"
    "policeAlarm36"     : "Маленькая Италия. Недалеко от квартиры семьи Скалетта. Вызов по кнопке"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "metro.toofaraway"                  : "[МЕТРО] Вы находитесь слишком далеко от станции!"
    "metro.notenoughmoney"              : "[МЕТРО] У вас недостаточно денег!"
    "metro.pay"                         : "[МЕТРО] Вы заплатили $%.2f за проезд."
    "metro.arrived"                     : "[МЕТРО] Вы прибыли на станцию %s."
    "metro.herealready"                 : "[МЕТРО] Вы и так уже здесь."
    "metro.notexist"                    : "[МЕТРО] Выбранной станции метро не существует."
    "metro.nocar"                       : "[МЕТРО] Метро - не паром. Выйдите из авто."

    "metro.listStations.title"          : "Список доступных станций метро:"
    "metro.listStations.station"        : "Станция #%d - %s"
    "metro.listStations.station.closed" : "Станция #%d - %s (закрыта)"

    "metro.station.closed.maintaince"   : "Станция %s закрыта по техническим причинам. Пожалуйста, воспользуйтесь другими станциями или используйте общественный транспорт."

    "metro.help.title"                  : "Найди ближайшую станцию для поездок на метро: /subway"
    "metro.help.subway"                 : "Отправиться на станцию по id"
    "metro.help.subwayList"             : "Посмотреть список всех станций"
    "metro.help.sub"                    : "Аналог /subway id"
    "metro.help.metro"                  : "Аналог /subway id"

    "metro.station.nearest.showblip"    : "[МЕТРО] Ближайшая станция (%s) отмечена на карте жёлтым маркером."

    "metro.dipton"      : "Диптон"
    "metro.uptown"      : "Аптаун"
    "metro.chinatown"   : "Чайнатаун"
    "metro.southport"   : "Сауспорт"
    "metro.westside"    : "Вест-Сайд"
    "metro.sandisland"  : "Сэнд-Айленд"
    "metro.kingston"    : "Кингстон"

    "metro.gui.window"   : "Метро Эмпайр-Бэй"
    "metro.gui.youhere"  : "Станция %s"
    "metro.gui.price"    : "Цена поездки: $%.2f"
    "metro.gui.close"    : "Закрыть"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.repairshop.toofar"             : "Вы слишком далеко от автомастерской!"
    "shops.repairshop.money.notenough"    : "Недостаточно денег. Для оплаты ремонта требуется $%.2f."
    "shops.repairshop.repair.payed"       : "Ремонт автомобиля обошёлся Вам в $%.2f. Будем рады видеть вас снова!"

    "shops.repairshop.needwait"           : "Ваша машина на ремонте. Ожидайте..."
    "shops.repairshop.ownership.wrong"    : "Прости, приятель, но это не твоя машина. Я не буду её перекрашивать."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.restaurant.toofar"               : "[INFO] Вы слишком далеко."
    "shops.restaurant.money.notenough"      : "У вас недостаточно денег для оплаты."
    "shops.needLTC"                         : "Предъявите лицензию на ношение оружия (поместите в руки)"
    "shops.restaurant.buy.success"          : "Вы купили %s за $%.2f."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.washstations.toofar"             : "Вы слишком далеко от автомойки!"
    "shops.washstations.money.notenough"    : "[АВТОМОЙКА] Недостаточно денег. Для оплаты мойки авто требуется $%.2f, а у вас только $%s."
    "shops.washstations.wash.payed"         : "[АВТОМОЙКА] Мойка автомобиля обошлась Вам в $%.2f. Ваш баланс $%s. Будем рады видеть вас снова!"
    "shops.washstations.needwait"           : "[АВТОМОЙКА] Ваша машина на мойке. Ожидайте..."

    "shops.washstations.help.title"         : "Список команд, доступных в автомойки:"
    "shops.washstations.help.wash"          : "Помыть автомобиль"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "shops.findcar.hello"       : "[ЗВОНОК] Empire Bay Car Searching Services. Мы найдём ваш автомобиль. Услуга стоит $%.2f. Оплата с банковского счёта."
    "shops.findcar.wait"        : "Идёт поиск... Пожалуйста, подождите..."
    "shops.findcar.found"       : "[ЗВОНОК] Мы нашли ваши автомобили. Благодарим за выбор Empire Bay Car Searching Services."
    "shops.findcar.seemap"      : "Метки всех ваших автомобилей отмечены на карте в течение 90 секунд."
    "shops.findcar.notenough"   : "[ЗВОНОК] К сожалению, у вас недостаточно средств на банковском счёте. До свидания."
    "shops.findcar.help"        : "Для начала поиска напишите в чат 'да' в течение %d секунд."
    "shops.findcar.canceled"    : "[ЗВОНОК] Если понадобится найти авто - звоните нам! Всего хорошего! (повесили трубку)"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "empirecustom.phone.hello"      : "[ЗВОНОК] Рекламное агентство Empire Custom. Мы поможем Вам разместить объявление! Услуга стоит $%.2f."
    "empirecustom.phone.notenough"  : "[ЗВОНОК] К сожалению, денег на вашем банковском счёте недостаточно."
    "empirecustom.phone.enter"      : "Введите текст вашего объявления:"
    "empirecustom.phone.help"       : "Напишите в чат текст объявления в течение %d секунд. Чтобы отказаться - напишите 0 или 'нет'."
    "empirecustom.phone.yourad"     : "Текст: %s"
    "empirecustom.phone.placed"     : "[ЗВОНОК] Ваше объявление будет опубликовано через 1 минуту. Благодарим за выбор Empire Custom. (повесили трубку)"
    "empirecustom.phone.ad"         : "[ОБЪЯВЛЕНИЕ] %s"
    "empirecustom.phone.canceled"   : "[ЗВОНОК] Если захотите разместить объявление - звоните нам! Всего хорошего! (повесили трубку)"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "telephone.findphone"   : "В течение 20 секунд на радаре отображается метка ближайшей телефонной будки."
    "telephone.findalready" : "Ближайшая телефонная будка уже отображена на радаре."
    "telephone.needphone"   : "Чтобы позвонить, нужно найти телефон."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "money.invoice.selectaction"        : "/pay %d, чтобы подтвердить оплату или /cancel %d, чтобы отклонить."
    "money.invoice.distancetoolarge"    : "Расстояние между вами и другим игроком слишком велико!"
    "money.invoice.notenoughmoney"      : "Недостаточно денег для оплаты!"
    "money.invoice.cantpay"             : "%s не может произвести оплату!"
    "money.invoice.needplayerid"        : "Для подтверждения оплаты необходимо указать id игрока."
    "money.invoice.senderoff"           : "Срок действия платежа истёк." //  sender offline

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "vehicle.sell.amount"       : "Вам нужно установить сумму, за которую вы хотите продать авто."
    "vehicle.sell.2passangers"  : "Человек, которому вы хотите продать, должен находиться в одном авто с вами."
    "vehicle.sell.ask"          : "%s предлагает вам приобрести это авто за $%.2f."
    "vehicle.sell.log"          : "Вы предложили %s купить это авто за $%.2f."
    "vehicle.sell.success"      : "Вы успешно продали это авто."
    "vehicle.buy.success"       : "Вы успешно приобрели это авто."
    "vehicle.sell.failure"      : "%s отказался от покупки этого авто."
    "vehicle.buy.failure"       : "Вы отказались от покупки этого авто."
    "vehicle.sell.notowner"     : "Вы не можете продать машину, которая вам не принадлежит."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "bk.disabled"           : "Stuart Booker: Приходи в другое время."
    "bk.goto"               : "[БК] Отправляйтесь к букмекеру на второй этаж бара «У Фредди»."
    "bk.selectsport"        : "[БК] Выберите спорт:"
    "bk.toselectsport"      : "[БК] Для выбора спорта используйте: /bk ID"
    "bk.horseriding"        : "1. Скачки"
    "bk.greyhound"          : "2. Собачьи бега"
    "bk.baseball"           : "3. Бейсбол"

    "bk.selectteam"         : "[БК] Выберите команду:"
    "bk.selecthorse"        : "[БК] Выберите лошадь:"
    "bk.selectdog"          : "[БК] Выберите гончую:"
    "bk.emptylist"          : "[БК] Нет доступных ставок. Приходите в другое время."
    "bk.toselectteam"       : "[БК] Min: $%s, Max: $%s. Сделать ставку: /bk ID СУММА"
    "bk.toselecthorse"      : "[БК] Min: $%s, Max: $%s. Сделать ставку: /bk ID СУММА"
    "bk.toselectdog"        : "[БК] Min: $%s, Max: $%s. Сделать ставку: /bk ID СУММА"

    "bk.needselectsport"    : "[БК] Сначала надо выбрать спорт."
    "bk.notenough"          : "[БК] У вас недостаточно денег."
    "bk.bettoomuch"         : "[БК] Ставка слишком высокая."
    "bk.bettoolow"          : "[БК] Ставка слишком низкая."
    "bk.betnotfound"        : "[БК] Вы можете ставить только на участников из списка."
    "bk.betmade"            : "[БК] Вы поставили $%.2f на победу %s."
    "bk.betwin"             : "[БК] Ваша ставка на «%s» выиграла. Вы заработали $%.2f."
    "bk.betlose"            : "[БК] Ваша ставка на «%s» проиграла. Вы потеряли $%.2f."

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "utils.hat"             : "В шапке %d шаров. %s вытащил шар номер %d."
    "utils.hatnull"         : "Нужно указать количество участников розыгрыша. Например: /hat 15"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "tutorial.continue" :  "(( Для продолжения нажимайте E ))"
    "turorial.spawn.1"  :  "Эй, друг. Здорово! Я смотрю ты приезжий. Подсказать может чего? Обращайся!"
    "tutorial.spawn.2"  :  "Значит так, это Эмпайр-Бэй - город, в котором мафия правит миром. Чтобы тут выжить - тебе нужны деньги."
    "tutorial.spawn.3"  :  "Зарабатывать деньги можно разными путями. Некоторые идут батрачить, другие связываются с криминалом."
    "tutorial.spawn.4"  :  "Если тебе нужна легальная работа - начни с грузчика в порту или на вокзале. Деньги хоть и не большие, но без штанов не останешься."
    "tutorial.spawn.5"  :  "Можешь поискать работу получше. Передвигаться по городу удобно на такси, метро или арендованном автомобиле."
    "tutorial.spawn.6"  :  "О, кстати, ты можешь купить свой автомобиль, даже несколько. Но придётся потрудиться!"
    "tutorial.spawn.7"  :  "Ну и как бы там ни было, я желаю тебе удачи!"
    "tutorial.spawn.8"  :  "Ах, ты хочешь, чтобы я рассказал тебе информацию еще раз? Хорошо!"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */
    "admin.startRR.message"     :"SERVER: Уважаемые игроки! Сервер будет перезагружен через 15 минут. Пожалуйста, завершите свою работу. Благодарю!"
    "admin.restart.message"     :"Внимание! Сервер будет перезагружен через %i минут."
    "admin.oocEnabled.message"  :"Общий чат был включен администратором!"
    "admin.oocDisabled.message" :"Общий чат был отключен администратором!"
/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */


/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */

    "error.title"               : "Ошибка!"

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------ */
    "character.invalid.rpname"      : "Ваш персонаж был создан с неправильным (Нон-РП) именем. Он будет удален. Пожалуйста, пересоздайте персонажа с другими именем и фамилией. Все деньги и другое имущество будет сохранено."
    "character.doesnotexist"        : "Персонаж с указанными данными\nне существует."
    "character.alreadymigrated"     : "Указанный персонаж уже\nбыл мигрирован."
    "character.limitexceeded"       : "Вы не можете создавать больше персонажей."
    "character.alreadyregistered"   : "Указанные Имя и Фамилия заняты.\nПожалуйста, придумайте другие.\n\nЗапрещено использовать все славянские имена\n и фамилии (русские, белорусские, украинские и т.д.),\nнаиболее популярные имена такие как Tom, Tommy,\nJoe, Vito, Henry, John, и фамилии Johnson, Angelo,\nScaletta, Barbaro, Corleone, Capone и другие,\nимена и фамилии политиков, известных актёров,\nмузыкальных исполнителей, спортсменов,\nгероев популярных игр и любых других\nизвестных личностей. Будьте оригинальными!\n\nМожете воспользоваться генераторами имён на сайте\nmafia2online.ru\nв разделе Инструкции -> Создание персонажа"
    "character.wrongname"           : "Вы указали неправильные Имя или Фамилию.\nПожалуйста, придумайте другие.\n\nЗапрещено использовать все славянские имена\n и фамилии (русские, белорусские, украинские и т.д.),\nнаиболее популярные имена такие как Tom, Tommy,\nJoe, Vito, Henry, John, и фамилии Johnson, Angelo,\nScaletta, Barbaro, Corleone, Capone и другие,\nимена и фамилии политиков, известных актёров,\nмузыкальных исполнителей, спортсменов,\nгероев популярных игр и любых других\nизвестных личностей. Будьте оригинальными!\n\nМожете воспользоваться генераторами имён на сайте\nmafia2online.ru\nв разделе Инструкции -> Создание персонажа"
    "character.bannednames"         : "Указанное Имя и/или Фамилия запрещены правилами.\nПожалуйста, придумайте другие.\n\nЗапрещено использовать все славянские имена\n и фамилии (русские, белорусские, украинские и т.д.),\nнаиболее популярные имена такие как Tom, Tommy,\nJoe, Vito, Henry, John, и фамилии Johnson, Angelo,\nScaletta, Barbaro, Corleone, Capone и другие,\nимена и фамилии политиков, известных актёров,\nмузыкальных исполнителей, спортсменов,\nгероев популярных игр и любых других\nизвестных личностей. Будьте оригинальными!\n\nМожете воспользоваться генераторами имён на сайте\nmafia2online.ru\nв разделе Инструкции -> Создание персонажа"
});


alternativeTranslate({

    "en|auth.GUI.TitleRegister"            : "Registration"
    "ru|auth.GUI.TitleRegister"            : "Регистрация"

    "en|auth.GUI.TitleLogin"               : "Authorization"
    "ru|auth.GUI.TitleLogin"               : "Авторизация"

    "en|auth.GUI.TitleLabelLogin"          : "Account %s already registered. Enter your password:"
    "ru|auth.GUI.TitleLabelLogin"          : "Аккаунт %s уже зарегистрирован. Введите пароль:"

    "en|auth.GUI.TitleInputLogin"          : "Password"
    "ru|auth.GUI.TitleInputLogin"          : "Пароль"

    "en|auth.GUI.ButtonLogin"              : "Log in"
    "ru|auth.GUI.ButtonLogin"              : "Авторизоваться"

    "en|auth.GUI.TitleLabelRegister"       : "Register a new account. Fill in the fields below:"
    "ru|auth.GUI.TitleLabelRegister"       : "Регистрация нового аккаунта. Заполните поля:"

    "en|auth.GUI.PasswordInput"            : "Create a password:"
    "ru|auth.GUI.PasswordInput"            : "Придумайте пароль:"

    "en|auth.GUI.RepeatPasswordInput"      : "Repeat password:"
    "ru|auth.GUI.RepeatPasswordInput"      : "Повторите пароль:"

    "en|auth.GUI.Email"                    : "Email:"
    "ru|auth.GUI.Email"                    : "Email:"

    "en|auth.GUI.ButtonRegister"           : "Sign up"
    "ru|auth.GUI.ButtonRegister"           : "Зарегистрироваться"

    "en|auth.GUI.error.notfound"           : "Incorrect login or password."
    "ru|auth.GUI.error.notfound"           : "Логин или пароль были введены неправильно."


    "en|auth.wrongname"        : "Invalid name!"
    "en|auth.wrongname2"       : "Your name should be at least 4 symbols and should not contain any symbols except letters, nubmers, space and underscore."
    "en|auth.changename"       : "Please, change you name in the settings, and reconnect. Thank you!"

    "en|auth.error.login"      : "[AUTH] You are already logined!"
    "en|auth.error.register"   : "[AUTH] Account with this name is already registered!"
    "en|auth.error.notfound"   : "[AUTH] Incorrect login or password."
    "en|auth.success.register" : "[AUTH] You've successfuly registered!"
    "en|auth.success.login"    : "Welcome to server NCRP!"
    "en|auth.success.autologin": "[AUTH] You've been automatically logined!"
    "en|auth.error.cmderror"   : "[AUTH] You can't execute commands without registration."
    "en|auth.notification"     : "[AUTH] You should enter into your account via /login PASSWORD, or create new one via /register PASSWORD"
    "en|auth.error.tomany"     : "You cant register more accounts."
    "ru|auth.client.notloaded1" : "Please wait until download files has finished."
    "ru|auth.client.notloaded2" : "If the authorization window does not appear, reconnect to the server."
    "en|auth.haveproblems"     : "     RU-localized site: mafia2online.ru | We're in Discord: bit.ly/m2ncrp"


    "ru|auth.wrongname"        : "Некорректное имя аккаунта!"
    "ru|auth.wrongname2"       : "Имя аккаунта должно быть больше 4 символов и может содержать ТОЛЬКО английские буквы, цифры, пробел и нижнее подчеркивание."
    "ru|auth.changename"       : "Пожалуйста, смените имя аккаунта в настройках (SETTINGS -> поле Nickname) и переподключитесь!"

    "ru|auth.error.login"      : "[AUTH] Вы уже вошли в аккаунт!"
    "ru|auth.error.register"   : "[AUTH] Аккаунт с таким именем уже зарегистрирован."
    "ru|auth.error.notfound"   : "[AUTH] Логин или пароль были введены неправильно."
    "ru|auth.success.register" : "[AUTH] Вы успешно зарегистрировались!"
    "ru|auth.success.login"    : "Добро пожаловать на сервер NCRP!"
    "ru|auth.success.autologin": "[AUTH] Вы были успешно авторизованы автоматически!"
    "ru|auth.error.cmderror"   : "[AUTH] Для выполнения команды Вам необходимо войти в аккаунт!"
    "ru|auth.notification"     : "[AUTH] Вам нужно войти в свой аккаунт используя /login ваш_пароль, или создать новый через /register ваш_пароль"
    "ru|auth.error.tomany"     : "Вы достигли лимита по количеству аккаунтов."
    "ru|auth.error.email"      : "Такой email адрес уже используется!"
    "ru|auth.client.notloaded1" : "Дождитесь пока завершится загрузка всех файлов."
    "ru|auth.client.notloaded2" : "По её завершению, если не появилось окно авторизации, переподключитесь к серверу."
    "ru|auth.haveproblems"     : "  Сайт: mafia2online.ru | vk.com/m2ncrp | Мы в Discord: bit.ly/m2ncrp"

    "ru|auth.under-construction1" : "На сервере проводятся плановые технические работы!"
    "en|auth.under-construction1" : "Server is under construction!"

    "ru|auth.under-construction2" : "Загляните к нам попозже!"
    "en|auth.under-construction2" : "See you later!"

    "en|hello.1"     : ".:: Jobs are marked a gray star on map."
    "ru|hello.1"     : ".:: Работы отмечены на карте серыми звёздами."

    "en|hello.2"     : ".:: Open map - key M."
    "ru|hello.2"     : ".:: Открыть карту - клавиша М англ."

    "en|hello.3"     : ".:: Write in chat: key Enter."
    "ru|hello.3"     : ".:: Написать в чат: Enter."

    "en|hello.4"     : ".:: You can get to the right place by metro, rented or private car."
    "ru|hello.4"     : ".:: Добраться до нужного места можно на метро, арендованном или личном автомобиле."

    "en|hello.5"     : ".:: Increase indicators of hunger and thirst above 75 percent and wait to restore the level of health."
    "ru|hello.5"     : ".:: Чтобы восстановить уровень здоровья - повысь индикаторы голода и жажды выше 75 процентов и жди регенерации."

    "en|hello.6"     : ".:: Need help? Write in chat: /help"
    "ru|hello.6"     : ".:: Нужна помощь? Напиши в чат: /help"

    "en|hello.start"     : ".:: First time here? Write /start"
    "ru|hello.start"     : ".:: Впервые на сервере? Пиши /start"

    "en|hello.help"     : ".:: Full help menu : /help"
    "ru|hello.help"     : ".:: Подробное меню помощи: /help"

    "en|hello.help-need"     : ".:: Be sure to familiarize yourself!"
    "ru|hello.help-need"     : ".:: Обязательно ознакомьтесь!"

    "en|hello.end"     : "We wish you a successful and enjoyable game!"
    "ru|hello.end"     : "Приятной игры!"

    "en|hello.news.title"     : "======= Breaking news! ======="
    "ru|hello.news.title"     : "======= Важное объявление! ======="

    "en|hello.news.text"     : "We are developing a new version of the server. So if for some reason the current functionality does not suit you, we recommend to visit us in a few months, as well as follow the development news on Discord."
    "ru|hello.news.text"     : "Мы занимаемся разработкой новой версии сервера. Поэтому если по каким-то причинам текущий функционал вам не подходит, рекомендуем заглянуть к нам через несколько месяцев, а также следить за новостями разработки в Discord и VK."
});
