/*
У нас проблема с установлением личности владельца, и когда у нас идёт какое-то дело нам нужна узнать владельца определённой машины, но от ШС толку нет, заберёт пока полиции нет и всё...
Так вот у меня небольшое решение.
А что если автомобиль со ШС можно будет забрать только владельцу только после одобрения полиции, то есть после беседы с ним и т.д
Но такие машины будут не все, будет другая команда помимо обычной команды /park будет и вторая /park supervision, такой командой будут отправлять автомобиль которые задействованы в делах или ещё в чём-то, короче те моменты где нужен нам сам владелец.
Итоговый смысл такой: автомобиль нельзя будет забрать с ШС без полиции, если его отправили через вторую команду

Сократить штрафстоянку, часть мест выделить с правой стороны. Владельцу показывать, что машина арестована.
Полицейский может снять арест.

Отправка на ШС только с указанием причины
*/

